In [2]:
import sqlite3 as sql;
import pandas;
from pandas import Series, DataFrame
import statsmodels.api as sm

In [ ]:
#does not allow import pandas as pd
import MySQLdb as sql

#servername-localhost, user, password, db name(e.g., db:bank and table:account)
db=sql.connect('localhost','root','7b48i49x','bank')

#prepare coursor
cursor=db.cursor()

#executa a query
cursor.execute("SELECT * FROM employee")


result=cursor.fetchall()#fetchone() would take only the first record

for r in result:
    print r #(r[1], r[2]) would yield the name and surname of the employees
    
#you must close the connection after each query
db.close()

In [ ]:
import dataset; #does not recognise the Dataset library
db = dataset.connect('sqlite:///data_wrangling.db')

In [0]:
import dataset #Dataset is just another library, I dont need this
# connecting to a SQLite database
db = dataset.connect('sqlite:///mydatabase.db')

# connecting to a MySQL database with user and password
db = dataset.connect('mysql://user:password@localhost/mydatabase')

#It is also possible to define the URL as an environment variable called DATABASE_URL so you can initialize database 
#connection without explicitly passing an URL:

db = dataset.connect()
#Depending on which database youâ€™re using, you may also have to install the database bindings to support that database. 
#SQLite is included in the Python core. MySQL can be enabled by installing the mysql-db drivers.

In [1]:
import sqlite3

In [8]:
query="""create table  test(a varchar(20), b varchar(20), c real, d integer);"""

In [9]:
con=sqlite3.connect(':memory:')#opens connection to RAM db and not to drive db

In [10]:
con.execute(query)

In [11]:
con.commit()

In [12]:
data=[('Atlanta', 'Georgia', 1.25, 6), #inserting some data
      ('tall', 'florida', 2.6,3),
      ('sacramento', 'calif', 1.7,5)]

In [13]:
stmt="insert into test values(?,?,?,?)"

In [14]:
con.executemany(stmt, data)

In [15]:
con.commit()

In [17]:
cursor=con.execute('select * from test')

In [18]:
rows=cursor.fetchall()

In [19]:
rows #we get a list of tuples

[(u'Atlanta', u'Georgia', 1.25, 6),
 (u'tall', u'florida', 2.6, 3),
 (u'sacramento', u'calif', 1.7, 5)]

In [20]:
cursor.description #we pass the list of tuples to DataFrame

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [21]:
from pandas import Series, DataFrame

In [30]:
states=DataFrame(rows, columns=zip(*cursor.description)[0])# we add the column names- abcd

In [31]:
states

            a        b     c  d
0     Atlanta  Georgia  1.25  6
1        tall  florida  2.60  3
2  sacramento    calif  1.70  5

In [23]:
import pandas.io.sql as sql #it can all be summed up to these two commands, by using pandas 'read_frame function'

In [ ]:
sql.read_frame('select * from test', con) #FutureWarning: read_frame is deprecated, use read_sql

In [32]:
states1=sql.read_sql('select * from test', con)

In [90]:
states1

            a        b     c  d
0     Atlanta  Georgia  1.25  6
1        tall  florida  2.60  3
2  sacramento    calif  1.70  5

In [37]:
state_correlat=states.corr() #nothing goes out, some cells have words

In [ ]:
#ANOTHER EXAMPLE

In [80]:
query1="""create table test5 (a integer, b integer, c integer, d integer, e integer);"""

In [81]:
con=sqlite3.connect(':memory:'); #these commands should also be executed again
con.execute(query1);
con.commit()

In [82]:
data_test5=[(1,2,5,2,5), #1 col writing, 2 col reading, 3 col math, 4 col histo, 5 col phys
            (2,3,4,2,5), 
            (3,5,2,2,4), 
            (4,4,1,4,2)] 
stat1="insert into test5 values (?,?,?,?,?)"

In [83]:
con.executemany(stat1, data_test5)

In [84]:
import pandas.io.sql as sql;
data_test5=sql.read_sql('select * from test5', con)

In [85]:
data_test5

   a  b  c  d  e
0  1  2  5  2  5
1  2  3  4  2  5
2  3  5  2  2  4
3  4  4  1  4  2

In [86]:
coral=data_test5.corr()

In [87]:
coral #1 col writing, 2 col reading, 3 col math, 4 col histo, 5 col phys

          a         b         c         d         e
a  1.000000  0.800000 -0.989949  0.774597 -0.912871
b  0.800000  1.000000 -0.848528  0.258199 -0.547723
c -0.989949 -0.848528  1.000000 -0.730297  0.903696
d  0.774597  0.258199 -0.730297  1.000000 -0.942809
e -0.912871 -0.547723  0.903696 -0.942809  1.000000

In [88]:
data_test5.describe() #descriptive statistics per column

              a         b         c    d         e
count  4.000000  4.000000  4.000000  4.0  4.000000
mean   2.500000  3.500000  3.000000  2.5  4.000000
std    1.290994  1.290994  1.825742  1.0  1.414214
min    1.000000  2.000000  1.000000  2.0  2.000000
25%    1.750000  2.750000  1.750000  2.0  3.500000
50%    2.500000  3.500000  3.000000  2.0  4.500000
75%    3.250000  4.250000  4.250000  2.5  5.000000
max    4.000000  5.000000  5.000000  4.0  5.000000

In [92]:
#REGRESSION

In [91]:
import statsmodels.api as sm